{
    "NOTE_ON_0": 0,
    "NOTE_ON_1": 1,
    "NOTE_ON_2": 2,
    "NOTE_ON_3": 3,
    "NOTE_ON_4": 4,
    "NOTE_ON_5": 5,
    "NOTE_ON_6": 6,
    "NOTE_ON_7": 7,
    "NOTE_ON_8": 8,
    "NOTE_ON_9": 9,
    "NOTE_ON_10": 10,
    "NOTE_ON_11": 11,
    "NOTE_ON_12": 12,
    "NOTE_ON_13": 13,
    "NOTE_ON_14": 14,
    "NOTE_ON_15": 15,
    "NOTE_ON_16": 16,
    "NOTE_ON_17": 17,
    "NOTE_ON_18": 18,
    "NOTE_ON_19": 19,
    "NOTE_ON_20": 20,
    "NOTE_ON_21": 21,
    "NOTE_ON_22": 22,
    "NOTE_ON_23": 23,
    "NOTE_ON_24": 24,
    "NOTE_ON_25": 25,
    "NOTE_ON_26": 26,
    "NOTE_ON_27": 27,
    "NOTE_ON_28": 28,
    "NOTE_ON_29": 29,
    "NOTE_ON_30": 30,
    "NOTE_ON_31": 31,
    "NOTE_ON_32": 32,
    "NOTE_ON_33": 33,
    "NOTE_ON_34": 34,
    "NOTE_ON_35": 35,
    "NOTE_ON_36": 36,
    "NOTE_ON_37": 37,
    "NOTE_ON_38": 38,
    "NOTE_ON_39": 39,
    "NOTE_ON_40": 40,
    "NOTE_ON_41": 41,
    "NOTE_ON_42": 42,
    "NOTE_ON_43": 43,
    "NOTE_ON_44": 44,
    "NOTE_ON_45": 45,
    "NOTE_ON_46": 46,
    "NOTE_ON_47": 47,
    "NOTE_ON_48": 48,
    "NOTE_ON_49": 49,
    "NOTE_ON_50": 50,
    "NOTE_ON_51": 51,
    "NOTE_ON_52": 52,
    "NOTE_ON_53": 53,
    "NOTE_ON_54": 54,
    "NOTE_ON_55": 55,
    "NOTE_ON_56": 56,
    "NOTE_ON_57": 57,
    "NOTE_ON_58": 58,
    "NOTE_ON_59": 59,
    "NOTE_ON_60": 60,
    "NOTE_ON_61": 61,
    "NOTE_ON_62": 62,
    "NOTE_ON_63": 63,
    "NOTE_ON_64": 64,
    "NOTE_ON_65": 65,
    "NOTE_ON_66": 66,
    "NOTE_ON_67": 67,
    "NOTE_ON_68": 68,
    "NOTE_ON_69": 69,
    "NOTE_ON_70": 70,
    "NOTE_ON_71": 71,
    "NOTE_ON_72": 72,
    "NOTE_ON_73": 73,
    "NOTE_ON_74": 74,
    "NOTE_ON_75": 75,
    "NOTE_ON_76": 76,
    "NOTE_ON_77": 77,
    "NOTE_ON_78": 78,
    "NOTE_ON_79": 79,
    "NOTE_ON_80": 80,
    "NOTE_ON_81": 81,
    "NOTE_ON_82": 82,
    "NOTE_ON_83": 83,
    "NOTE_ON_84": 84,
    "NOTE_ON_85": 85,
    "NOTE_ON_86": 86,
    "NOTE_ON_87": 87,
    "NOTE_ON_88": 88,
    "NOTE_ON_89": 89,
    "NOTE_ON_90": 90,
    "NOTE_ON_91": 91,
    "NOTE_ON_92": 92,
    "NOTE_ON_93": 93,
    "NOTE_ON_94": 94,
    "NOTE_ON_95": 95,
    "NOTE_ON_96": 96,
    "NOTE_ON_97": 97,
    "NOTE_ON_98": 98,
    "NOTE_ON_99": 99,
    "NOTE_ON_100": 100,
    "NOTE_ON_101": 101,
    "NOTE_ON_102": 102,
    "NOTE_ON_103": 103,
    "NOTE_ON_104": 104,
    "NOTE_ON_105": 105,
    "NOTE_ON_106": 106,
    "NOTE_ON_107": 107,
    "NOTE_ON_108": 108,
    "NOTE_ON_109": 109,
    "NOTE_ON_110": 110,
    "NOTE_ON_111": 111,
    "NOTE_ON_112": 112,
    "NOTE_ON_113": 113,
    "NOTE_ON_114": 114,
    "NOTE_ON_115": 115,
    "NOTE_ON_116": 116,
    "NOTE_ON_117": 117,
    "NOTE_ON_118": 118,
    "NOTE_ON_119": 119,
    "NOTE_ON_120": 120,
    "NOTE_ON_121": 121,
    "NOTE_ON_122": 122,
    "NOTE_ON_123": 123,
    "NOTE_ON_124": 124,
    "NOTE_ON_125": 125,
    "NOTE_ON_126": 126,
    "NOTE_ON_127": 127,
    "NOTE_OFF_0": 128,
    "NOTE_OFF_1": 129,
    "NOTE_OFF_2": 130,
    "NOTE_OFF_3": 131,
    "NOTE_OFF_4": 132,
    "NOTE_OFF_5": 133,
    "NOTE_OFF_6": 134,
    "NOTE_OFF_7": 135,
    "NOTE_OFF_8": 136,
    "NOTE_OFF_9": 137,
    "NOTE_OFF_10": 138,
    "NOTE_OFF_11": 139,
    "NOTE_OFF_12": 140,
    "NOTE_OFF_13": 141,
    "NOTE_OFF_14": 142,
    "NOTE_OFF_15": 143,
    "NOTE_OFF_16": 144,
    "NOTE_OFF_17": 145,
    "NOTE_OFF_18": 146,
    "NOTE_OFF_19": 147,
    "NOTE_OFF_20": 148,
    "NOTE_OFF_21": 149,
    "NOTE_OFF_22": 150,
    "NOTE_OFF_23": 151,
    "NOTE_OFF_24": 152,
    "NOTE_OFF_25": 153,
    "NOTE_OFF_26": 154,
    "NOTE_OFF_27": 155,
    "NOTE_OFF_28": 156,
    "NOTE_OFF_29": 157,
    "NOTE_OFF_30": 158,
    "NOTE_OFF_31": 159,
    "NOTE_OFF_32": 160,
    "NOTE_OFF_33": 161,
    "NOTE_OFF_34": 162,
    "NOTE_OFF_35": 163,
    "NOTE_OFF_36": 164,
    "NOTE_OFF_37": 165,
    "NOTE_OFF_38": 166,
    "NOTE_OFF_39": 167,
    "NOTE_OFF_40": 168,
    "NOTE_OFF_41": 169,
    "NOTE_OFF_42": 170,
    "NOTE_OFF_43": 171,
    "NOTE_OFF_44": 172,
    "NOTE_OFF_45": 173,
    "NOTE_OFF_46": 174,
    "NOTE_OFF_47": 175,
    "NOTE_OFF_48": 176,
    "NOTE_OFF_49": 177,
    "NOTE_OFF_50": 178,
    "NOTE_OFF_51": 179,
    "NOTE_OFF_52": 180,
    "NOTE_OFF_53": 181,
    "NOTE_OFF_54": 182,
    "NOTE_OFF_55": 183,
    "NOTE_OFF_56": 184,
    "NOTE_OFF_57": 185,
    "NOTE_OFF_58": 186,
    "NOTE_OFF_59": 187,
    "NOTE_OFF_60": 188,
    "NOTE_OFF_61": 189,
    "NOTE_OFF_62": 190,
    "NOTE_OFF_63": 191,
    "NOTE_OFF_64": 192,
    "NOTE_OFF_65": 193,
    "NOTE_OFF_66": 194,
    "NOTE_OFF_67": 195,
    "NOTE_OFF_68": 196,
    "NOTE_OFF_69": 197,
    "NOTE_OFF_70": 198,
    "NOTE_OFF_71": 199,
    "NOTE_OFF_72": 200,
    "NOTE_OFF_73": 201,
    "NOTE_OFF_74": 202,
    "NOTE_OFF_75": 203,
    "NOTE_OFF_76": 204,
    "NOTE_OFF_77": 205,
    "NOTE_OFF_78": 206,
    "NOTE_OFF_79": 207,
    "NOTE_OFF_80": 208,
    "NOTE_OFF_81": 209,
    "NOTE_OFF_82": 210,
    "NOTE_OFF_83": 211,
    "NOTE_OFF_84": 212,
    "NOTE_OFF_85": 213,
    "NOTE_OFF_86": 214,
    "NOTE_OFF_87": 215,
    "NOTE_OFF_88": 216,
    "NOTE_OFF_89": 217,
    "NOTE_OFF_90": 218,
    "NOTE_OFF_91": 219,
    "NOTE_OFF_92": 220,
    "NOTE_OFF_93": 221,
    "NOTE_OFF_94": 222,
    "NOTE_OFF_95": 223,
    "NOTE_OFF_96": 224,
    "NOTE_OFF_97": 225,
    "NOTE_OFF_98": 226,
    "NOTE_OFF_99": 227,
    "NOTE_OFF_100": 228,
    "NOTE_OFF_101": 229,
    "NOTE_OFF_102": 230,
    "NOTE_OFF_103": 231,
    "NOTE_OFF_104": 232,
    "NOTE_OFF_105": 233,
    "NOTE_OFF_106": 234,
    "NOTE_OFF_107": 235,
    "NOTE_OFF_108": 236,
    "NOTE_OFF_109": 237,
    "NOTE_OFF_110": 238,
    "NOTE_OFF_111": 239,
    "NOTE_OFF_112": 240,
    "NOTE_OFF_113": 241,
    "NOTE_OFF_114": 242,
    "NOTE_OFF_115": 243,
    "NOTE_OFF_116": 244,
    "NOTE_OFF_117": 245,
    "NOTE_OFF_118": 246,
    "NOTE_OFF_119": 247,
    "NOTE_OFF_120": 248,
    "NOTE_OFF_121": 249,
    "NOTE_OFF_122": 250,
    "NOTE_OFF_123": 251,
    "NOTE_OFF_124": 252,
    "NOTE_OFF_125": 253,
    "NOTE_OFF_126": 254,
    "NOTE_OFF_127": 255,
    "TIME_SHIFT_10ms": 256,
    "TIME_SHIFT_20ms": 257,
    "TIME_SHIFT_30ms": 258,
    "TIME_SHIFT_40ms": 259,
    "TIME_SHIFT_50ms": 260,
    "TIME_SHIFT_60ms": 261,
    "TIME_SHIFT_70ms": 262,
    "TIME_SHIFT_80ms": 263,
    "TIME_SHIFT_90ms": 264,
    "TIME_SHIFT_100ms": 265,
    "TIME_SHIFT_110ms": 266,
    "TIME_SHIFT_120ms": 267,
    "TIME_SHIFT_130ms": 268,
    "TIME_SHIFT_140ms": 269,
    "TIME_SHIFT_150ms": 270,
    "TIME_SHIFT_160ms": 271,
    "TIME_SHIFT_170ms": 272,
    "TIME_SHIFT_180ms": 273,
    "TIME_SHIFT_190ms": 274,
    "TIME_SHIFT_200ms": 275,
    "TIME_SHIFT_210ms": 276,
    "TIME_SHIFT_220ms": 277,
    "TIME_SHIFT_230ms": 278,
    "TIME_SHIFT_240ms": 279,
    "TIME_SHIFT_250ms": 280,
    "TIME_SHIFT_260ms": 281,
    "TIME_SHIFT_270ms": 282,
    "TIME_SHIFT_280ms": 283,
    "TIME_SHIFT_290ms": 284,
    "TIME_SHIFT_300ms": 285,
    "TIME_SHIFT_310ms": 286,
    "TIME_SHIFT_320ms": 287,
    "TIME_SHIFT_330ms": 288,
    "TIME_SHIFT_340ms": 289,
    "TIME_SHIFT_350ms": 290,
    "TIME_SHIFT_360ms": 291,
    "TIME_SHIFT_370ms": 292,
    "TIME_SHIFT_380ms": 293,
    "TIME_SHIFT_390ms": 294,
    "TIME_SHIFT_400ms": 295,
    "TIME_SHIFT_410ms": 296,
    "TIME_SHIFT_420ms": 297,
    "TIME_SHIFT_430ms": 298,
    "TIME_SHIFT_440ms": 299,
    "TIME_SHIFT_450ms": 300,
    "TIME_SHIFT_460ms": 301,
    "TIME_SHIFT_470ms": 302,
    "TIME_SHIFT_480ms": 303,
    "TIME_SHIFT_490ms": 304,
    "TIME_SHIFT_500ms": 305,
    "TIME_SHIFT_510ms": 306,
    "TIME_SHIFT_520ms": 307,
    "TIME_SHIFT_530ms": 308,
    "TIME_SHIFT_540ms": 309,
    "TIME_SHIFT_550ms": 310,
    "TIME_SHIFT_560ms": 311,
    "TIME_SHIFT_570ms": 312,
    "TIME_SHIFT_580ms": 313,
    "TIME_SHIFT_590ms": 314,
    "TIME_SHIFT_600ms": 315,
    "TIME_SHIFT_610ms": 316,
    "TIME_SHIFT_620ms": 317,
    "TIME_SHIFT_630ms": 318,
    "TIME_SHIFT_640ms": 319,
    "TIME_SHIFT_650ms": 320,
    "TIME_SHIFT_660ms": 321,
    "TIME_SHIFT_670ms": 322,
    "TIME_SHIFT_680ms": 323,
    "TIME_SHIFT_690ms": 324,
    "TIME_SHIFT_700ms": 325,
    "TIME_SHIFT_710ms": 326,
    "TIME_SHIFT_720ms": 327,
    "TIME_SHIFT_730ms": 328,
    "TIME_SHIFT_740ms": 329,
    "TIME_SHIFT_750ms": 330,
    "TIME_SHIFT_760ms": 331,
    "TIME_SHIFT_770ms": 332,
    "TIME_SHIFT_780ms": 333,
    "TIME_SHIFT_790ms": 334,
    "TIME_SHIFT_800ms": 335,
    "TIME_SHIFT_810ms": 336,
    "TIME_SHIFT_820ms": 337,
    "TIME_SHIFT_830ms": 338,
    "TIME_SHIFT_840ms": 339,
    "TIME_SHIFT_850ms": 340,
    "TIME_SHIFT_860ms": 341,
    "TIME_SHIFT_870ms": 342,
    "TIME_SHIFT_880ms": 343,
    "TIME_SHIFT_890ms": 344,
    "TIME_SHIFT_900ms": 345,
    "TIME_SHIFT_910ms": 346,
    "TIME_SHIFT_920ms": 347,
    "TIME_SHIFT_930ms": 348,
    "TIME_SHIFT_940ms": 349,
    "TIME_SHIFT_950ms": 350,
    "TIME_SHIFT_960ms": 351,
    "TIME_SHIFT_970ms": 352,
    "TIME_SHIFT_980ms": 353,
    "TIME_SHIFT_990ms": 354,
    "TIME_SHIFT_1000ms": 355,
    "VELOCITY_1": 356,
    "VELOCITY_2": 357,
    "VELOCITY_3": 358,
    "VELOCITY_4": 359,
    "VELOCITY_5": 360,
    "VELOCITY_6": 361,
    "VELOCITY_7": 362,
    "VELOCITY_8": 363,
    "VELOCITY_9": 364,
    "VELOCITY_10": 365,
    "VELOCITY_11": 366,
    "VELOCITY_12": 367,
    "VELOCITY_13": 368,
    "VELOCITY_14": 369,
    "VELOCITY_15": 370,
    "VELOCITY_16": 371,
    "VELOCITY_17": 372,
    "VELOCITY_18": 373,
    "VELOCITY_19": 374,
    "VELOCITY_20": 375,
    "VELOCITY_21": 376,
    "VELOCITY_22": 377,
    "VELOCITY_23": 378,
    "VELOCITY_24": 379,
    "VELOCITY_25": 380,
    "VELOCITY_26": 381,
    "VELOCITY_27": 382,
    "VELOCITY_28": 383,
    "VELOCITY_29": 384,
    "VELOCITY_30": 385,
    "VELOCITY_31": 386,
    "VELOCITY_32": 387,
    "TOKEN_PAD": 388
}